#+title: Notes
#+begin_src jupyter-python :session *nwss
import numpy as np
import pandas as pd
from sodapy import Socrata
token = os.environ.get("SODAPY_APPTOKEN")
client = Socrata("data.cdc.gov", token)
results = client.get("g653-rqe2", limit=10**10)

df = pd.DataFrame.from_records(results)
df.transpose()
client = Socrata("data.cdc.gov", token)
results_metric = client.get("2ew6-ywp6", limit=10**10)

df_metric = pd.DataFrame.from_records(results_metric)
#+end_src

#+RESULTS:

* Examining the Keys
** =wwtp_jurisdiction=
#+begin_quote
State, DC, US territory, or Freely Associated State jurisdiction name (2-letter abbreviation) in which the wastewater treatment plant provided in 'wwtp_id' is located.
#+end_quote
first, looking to see what the values of =wwtp_jurisdiction= actually are:
#+begin_src jupyter-python :session *nwss
wwtp_jur = df_metric.wwtp_jurisdiction.unique()
wwtp_jur.sort()
wwtp_jur
#+end_src

#+RESULTS:
#+begin_example
array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia',
       'Florida', 'Georgia', 'Guam', 'Hawaii', 'Idaho', 'Illinois',
       'Indiana', 'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine',
       'Maryland', 'Massachusetts', 'Michigan', 'Minnesota',
       'Mississippi', 'Missouri', 'Montana', 'Nebraska', 'Nevada',
       'New Hampshire', 'New Jersey', 'New Mexico', 'New York',
       'New York City', 'North Carolina', 'North Dakota', 'Ohio',
       'Oklahoma', 'Oregon', 'Pennsylvania', 'Rhode Island',
       'South Carolina', 'South Dakota', 'Tennessee', 'Texas', 'Utah',
       'Vermont', 'Virginia', 'Washington', 'West Virginia', 'Wisconsin',
       'Wyoming'], dtype=object)
#+end_example
53 entries: 50 states, DC Guam, and NYC
** =wwtp_id=
#+begin_quote
A unique identifier for wastewater treatment plants. This is an arbitrary integer used to provide a unique, but anonymous identifier for a wastewater treatment plant. This identifier is consistent over time, such that the same plant retains the same ID regardless of the addition or subtraction of other plants from the data set.
#+end_quote
Not too much to say here, there are
#+begin_src jupyter-python :session *nwss
len(df_metric.wwtp_id.unique())
#+end_src

#+RESULTS:
: 1478
of them, nearing double the number of counties. More discussion comparing these with counties later.
** =reporting_jurisidiction=
#+begin_src jupyter-python :session *nwss
reporters = df_metric.reporting_jurisdiction.unique()
reporters.sort()
len(reporters)
#+end_src

#+RESULTS:
: 55
These aren't quite the same as the wwtp jurisdictions...
#+begin_src jupyter-python :session *nwss
np.setdiff1d(reporters, wwtp_jur)
#+end_src

#+RESULTS:
: array(['Chicago', 'Houston'], dtype=object)

and what of chicago? Its reported in Illinois

#+begin_src jupyter-python :session *nwss
df_metric[df_metric.reporting_jurisdiction == "Chicago"].transpose()
#+end_src

#+RESULTS:
#+begin_example
                                                                    3549    \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                675   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_675_Before treatment plant_21_raw wast...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                    24099   
date_start                                                      2023-03-07   
date_end                                                        2023-03-21   
detect_prop_15d                                                        100   
percentile                                                            84.0   
sampling_prior                                                          no   
first_sample_date                                               2023-03-21   
ptc_15d                                                                NaN   
sample_location_specify                                                 21   

                                                                    3550    \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                675   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_675_Before treatment plant_21_raw wast...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                    24099   
date_start                                                      2023-03-08   
date_end                                                        2023-03-22   
detect_prop_15d                                                        100   
percentile                                                            84.0   
sampling_prior                                                          no   
first_sample_date                                               2023-03-21   
ptc_15d                                                                NaN   
sample_location_specify                                                 21   

                                                                    3551    \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                675   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_675_Before treatment plant_21_raw wast...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                    24099   
date_start                                                      2023-03-09   
date_end                                                        2023-03-23   
detect_prop_15d                                                        100   
percentile                                                            74.5   
sampling_prior                                                          no   
first_sample_date                                               2023-03-21   
ptc_15d                                                                -32   
sample_location_specify                                                 21   

                                                                    3552    \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                675   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_675_Before treatment plant_21_raw wast...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                    24099   
date_start                                                      2023-03-10   
date_end                                                        2023-03-24   
detect_prop_15d                                                        100   
percentile                                                            74.5   
sampling_prior                                                          no   
first_sample_date                                               2023-03-21   
ptc_15d                                                                -32   
sample_location_specify                                                 21   

                                                                    3553    \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                675   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_675_Before treatment plant_21_raw wast...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                    24099   
date_start                                                      2023-03-11   
date_end                                                        2023-03-25   
detect_prop_15d                                                        100   
percentile                                                            74.5   
sampling_prior                                                          no   
first_sample_date                                               2023-03-21   
ptc_15d                                                                -32   
sample_location_specify                                                 21   

                                                                    3554    \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                675   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_675_Before treatment plant_21_raw wast...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                    24099   
date_start                                                      2023-03-12   
date_end                                                        2023-03-26   
detect_prop_15d                                                        100   
percentile                                                            74.5   
sampling_prior                                                          no   
first_sample_date                                               2023-03-21   
ptc_15d                                                                -32   
sample_location_specify                                                 21   

                                                                    3555    \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                675   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_675_Before treatment plant_21_raw wast...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                    24099   
date_start                                                      2023-03-13   
date_end                                                        2023-03-27   
detect_prop_15d                                                        100   
percentile                                                            74.5   
sampling_prior                                                          no   
first_sample_date                                               2023-03-21   
ptc_15d                                                                -32   
sample_location_specify                                                 21   

                                                                    3556    \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                675   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_675_Before treatment plant_21_raw wast...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                    24099   
date_start                                                      2023-03-14   
date_end                                                        2023-03-28   
detect_prop_15d                                                        100   
percentile                                                          82.333   
sampling_prior                                                          no   
first_sample_date                                               2023-03-21   
ptc_15d                                                                 70   
sample_location_specify                                                 21   

                                                                    3557    \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                675   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_675_Before treatment plant_21_raw wast...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                    24099   
date_start                                                      2023-03-15   
date_end                                                        2023-03-29   
detect_prop_15d                                                        100   
percentile                                                          82.333   
sampling_prior                                                          no   
first_sample_date                                               2023-03-21   
ptc_15d                                                                 70   
sample_location_specify                                                 21   

                                                                    3558    \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                675   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_675_Before treatment plant_21_raw wast...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                    24099   
date_start                                                      2023-03-16   
date_end                                                        2023-03-30   
detect_prop_15d                                                        100   
percentile                                                            78.5   
sampling_prior                                                          no   
first_sample_date                                               2023-03-21   
ptc_15d                                                                 17   
sample_location_specify                                                 21   

                         ...  \
wwtp_jurisdiction        ...   
wwtp_id                  ...   
reporting_jurisdiction   ...   
sample_location          ...   
key_plot_id              ...   
county_names             ...   
county_fips              ...   
population_served        ...   
date_start               ...   
date_end                 ...   
detect_prop_15d          ...   
percentile               ...   
sampling_prior           ...   
first_sample_date        ...   
ptc_15d                  ...   
sample_location_specify  ...   

                                                                    516924  \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                635   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_635_Before treatment plant_489_raw was...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                   125995   
date_start                                                      2023-09-18   
date_end                                                        2023-10-02   
detect_prop_15d                                                        100   
percentile                                                            68.8   
sampling_prior                                                          no   
first_sample_date                                               2023-05-03   
ptc_15d                                                                 10   
sample_location_specify                                                489   

                                                                    516925  \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                635   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_635_Before treatment plant_489_raw was...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                   125995   
date_start                                                      2023-09-19   
date_end                                                        2023-10-03   
detect_prop_15d                                                        100   
percentile                                                            68.8   
sampling_prior                                                          no   
first_sample_date                                               2023-05-03   
ptc_15d                                                                  4   
sample_location_specify                                                489   

                                                                    516926  \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                635   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_635_Before treatment plant_489_raw was...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                   125995   
date_start                                                      2023-09-20   
date_end                                                        2023-10-04   
detect_prop_15d                                                        100   
percentile                                                            67.4   
sampling_prior                                                          no   
first_sample_date                                               2023-05-03   
ptc_15d                                                                  5   
sample_location_specify                                                489   

                                                                    516927  \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                635   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_635_Before treatment plant_489_raw was...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                   125995   
date_start                                                      2023-09-21   
date_end                                                        2023-10-05   
detect_prop_15d                                                        100   
percentile                                                            67.4   
sampling_prior                                                          no   
first_sample_date                                               2023-05-03   
ptc_15d                                                                 30   
sample_location_specify                                                489   

                                                                    516928  \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                635   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_635_Before treatment plant_489_raw was...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                   125995   
date_start                                                      2023-09-22   
date_end                                                        2023-10-06   
detect_prop_15d                                                        100   
percentile                                                            67.4   
sampling_prior                                                          no   
first_sample_date                                               2023-05-03   
ptc_15d                                                                 30   
sample_location_specify                                                489   

                                                                    516929  \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                635   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_635_Before treatment plant_489_raw was...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                   125995   
date_start                                                      2023-09-23   
date_end                                                        2023-10-07   
detect_prop_15d                                                        100   
percentile                                                            67.4   
sampling_prior                                                          no   
first_sample_date                                               2023-05-03   
ptc_15d                                                                 30   
sample_location_specify                                                489   

                                                                    516930  \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                635   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_635_Before treatment plant_489_raw was...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                   125995   
date_start                                                      2023-09-24   
date_end                                                        2023-10-08   
detect_prop_15d                                                        100   
percentile                                                            67.4   
sampling_prior                                                          no   
first_sample_date                                               2023-05-03   
ptc_15d                                                                 30   
sample_location_specify                                                489   

                                                                    516931  \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                635   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_635_Before treatment plant_489_raw was...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                   125995   
date_start                                                      2023-09-25   
date_end                                                        2023-10-09   
detect_prop_15d                                                        100   
percentile                                                            67.8   
sampling_prior                                                          no   
first_sample_date                                               2023-05-03   
ptc_15d                                                                  4   
sample_location_specify                                                489   

                                                                    516932  \
wwtp_jurisdiction                                                 Illinois   
wwtp_id                                                                635   
reporting_jurisdiction                                             Chicago   
sample_location                                     Before treatment plant   
key_plot_id              NWSS_il_635_Before treatment plant_489_raw was...   
county_names                                                          Cook   
county_fips                                                          17031   
population_served                                                   125995   
date_start                                                      2023-09-26   
date_end                                                        2023-10-10   
detect_prop_15d                                                        100   
percentile                                                            67.8   
sampling_prior                                                          no   
first_sample_date                                               2023-05-03   
ptc_15d                                                                 -8   
sample_location_specify                                                489   

                                                                    516933  
wwtp_jurisdiction                                                 Illinois  
wwtp_id                                                                635  
reporting_jurisdiction                                             Chicago  
sample_location                                     Before treatment plant  
key_plot_id              NWSS_il_635_Before treatment plant_489_raw was...  
county_names                                                          Cook  
county_fips                                                          17031  
population_served                                                   125995  
date_start                                                      2023-09-27  
date_end                                                        2023-10-11  
detect_prop_15d                                                        100  
percentile                                                            67.8  
sampling_prior                                                          no  
first_sample_date                                               2023-05-03  
ptc_15d                                                                 -8  
sample_location_specify                                                489  

[16 rows x 3179 columns]
#+end_example


#+begin_quote
The CDC Epidemiology and Laboratory Capacity (ELC) jurisdiction, most frequently a state, reporting these data (2-letter abbreviation)
#+end_quote
** sample location
#+begin_quote
Sample collection location in the wastewater system, whether at a wastewater treatment plant (or other community level treatment infrastructure such as community-scale septic) or upstream in the wastewater system.
#+end_quote
binary variable
#+begin_src jupyter-python :session *nwss
df_metric.sample_location.unique()
#+end_src

#+RESULTS:
: array(['Treatment plant', 'Before treatment plant'], dtype=object)

With before treatment saying that sample_location_specify has meaningful content
*** sample_location_specify
#+begin_quote
A unique identifier for "upstream" sample locations. Specifically, when 'sample_location' is "upstream", this field has a non-empty value, which provides a unique, but anonymous identifier for the upstream sample collection sites. This identifier is consistent over time, such that the same sample collection site retains the same ID regardless of the addition or subtraction of other sample collection sites from the data set.
#+end_quote

#+begin_src jupyter-python :session *nwss
df_metric.groupby(by = "sample_location").agg({"sample_location_specify": "nunique"})
#+end_src

#+RESULTS:
:                         sample_location_specify
: sample_location
: Before treatment plant                       86
: Treatment plant                              18

#+begin_src jupyter-python :session *nwss
before_treatment_values = df_metric.sample_location_specify[df_metric.sample_location == "Before treatment plant"].unique()
before_treatment_values = before_treatment_values.astype(float)
before_treatment_values
#+end_src

#+RESULTS:
: array([ 21., 147., 550., 468.,  95.,  86.,  96.,  94., 490., 113., 488.,
:        482.,  97., 222., 574., 466., 171., 305.,  17., 206.,  91., 301.,
:        553.,  98., 122., 481., 123., 223., 549., 145., 300., 500., 142.,
:         82., 524., 203., 208., 224., 546., 469., 116., 128., 221.,  16.,
:        126., 130., 124., 525.,  75., 491., 470., 229.,  20., 129., 227.,
:        465.,  19., 119., 483.,  78., 526.,  99.,  76.,  18.,  92., 156.,
:        489., 484.,  77., 357., 464., 141., 121., 452.,  79., 127., 499.,
:          7., 302.,  80., 205., 207.,  84.,  83.,  93., 125.])

#+begin_src jupyter-python :session *nwss
treatment_plant_values = df_metric.sample_location_specify[df_metric.sample_location == "Treatment plant"].unique()
treatment_plant_values = treatment_plant_values.astype(float)
treatment_plant_values
#+end_src

#+RESULTS:
: array([ nan, 459., 496.,   3., 497., 570., 552., 467., 495.,   7., 457.,
:        494., 514.,   2., 493., 515.,  85., 568., 569.])
Strangely, this is not just the singleton nan...

Do these overlap?
#+begin_src jupyter-python :session *nwss
np.intersect1d(treatment_plant_values, before_treatment_values)
#+end_src

#+RESULTS:
: array([7.])

Sooo there is one single intersection... how strange

** =county_names= & =county_fips=
#+begin_src jupyter-python :session *nwss
len(df_metric.county_fips.unique())
#+end_src

#+RESULTS:
: 844

#+begin_src jupyter-python :session *nwss
unique_fips = df_metric.county_fips.unique()
np.extract("," , unique_fips)
multi_fips = [x for x in unique_fips if ',' in x]
single_fips = [x for x in unique_fips if not ',' in x]
(len(multi_fips), len(single_fips))
#+end_src

#+RESULTS:
| 103 | 741 |
so there's an appreciable number with multi-counties per sample area
** Map between =wwtp_id= and =county_fips=?
It would be good to know if one is a subset of the other. Somewhat difficult to actually calculate.

*** =wwtp_id= -> =county_fips=?
First, for each =wwtp_id=, how many =county_fips= are there?
#+begin_src jupyter-python :session *nwss
df_metric.groupby(by = "wwtp_id").agg({"county_fips" : "nunique"}).sort_values(by="county_fips")
#+end_src

#+RESULTS:
#+begin_example
         county_fips
wwtp_id
1                  1
265                1
264                1
260                1
26                 1
...              ...
11                 2
363                2
446                2
291                2
1729               3

[1478 rows x 1 columns]
#+end_example
so there are many with 2, and one with 3.

Looking at the example crossing 3 counties:
#+begin_src jupyter-python :session *nwss
df_metric[(df_metric.wwtp_id == '1729') & (df_metric.date_start=="2022-12-05")].transpose()
#+end_src

#+RESULTS:
#+begin_example
                                                                    133258  \
wwtp_jurisdiction                                                 Michigan
wwtp_id                                                               1729
reporting_jurisdiction                                            Michigan
sample_location                                     Before treatment plant
key_plot_id              NWSS_mi_1729_Before treatment plant_466_raw wa...
county_names                                                         Wayne
county_fips                                                          26163
population_served                                                    51939
date_start                                                      2022-12-05
date_end                                                        2022-12-19
detect_prop_15d                                                        100
percentile                                                            93.0
sampling_prior                                                          no
first_sample_date                                               2022-12-19
ptc_15d                                                                NaN
sample_location_specify                                                466

                                                                    138933  \
wwtp_jurisdiction                                                 Michigan
wwtp_id                                                               1729
reporting_jurisdiction                                            Michigan
sample_location                                     Before treatment plant
key_plot_id              NWSS_mi_1729_Before treatment plant_305_raw wa...
county_names                                                        Macomb
county_fips                                                          26099
population_served                                                     4934
date_start                                                      2022-12-05
date_end                                                        2022-12-19
detect_prop_15d                                                        100
percentile                                                            87.5
sampling_prior                                                         yes
first_sample_date                                               2021-07-21
ptc_15d                                                                339
sample_location_specify                                                305

                                                                    147124  \
wwtp_jurisdiction                                                 Michigan
wwtp_id                                                               1729
reporting_jurisdiction                                            Michigan
sample_location                                     Before treatment plant
key_plot_id              NWSS_mi_1729_Before treatment plant_206_raw wa...
county_names                                                       Oakland
county_fips                                                          26125
population_served                                                     3080
date_start                                                      2022-12-05
date_end                                                        2022-12-19
detect_prop_15d                                                        NaN
percentile                                                             NaN
sampling_prior                                                         yes
first_sample_date                                               2021-09-02
ptc_15d                                                                NaN
sample_location_specify                                                206

                                                                    164047  \
wwtp_jurisdiction                                                 Michigan
wwtp_id                                                               1729
reporting_jurisdiction                                            Michigan
sample_location                                     Before treatment plant
key_plot_id              NWSS_mi_1729_Before treatment plant_301_raw wa...
county_names                                                        Macomb
county_fips                                                          26099
population_served                                                    29555
date_start                                                      2022-12-05
date_end                                                        2022-12-19
detect_prop_15d                                                        100
percentile                                                            71.0
sampling_prior                                                         yes
first_sample_date                                               2021-07-21
ptc_15d                                                                -54
sample_location_specify                                                301

                                                                    263389  \
wwtp_jurisdiction                                                 Michigan
wwtp_id                                                               1729
reporting_jurisdiction                                            Michigan
sample_location                                     Before treatment plant
key_plot_id              NWSS_mi_1729_Before treatment plant_300_raw wa...
county_names                                                        Macomb
county_fips                                                          26099
population_served                                                    19662
date_start                                                      2022-12-05
date_end                                                        2022-12-19
detect_prop_15d                                                        100
percentile                                                            74.0
sampling_prior                                                         yes
first_sample_date                                               2021-07-21
ptc_15d                                                                -28
sample_location_specify                                                300

                                                                    302601  \
wwtp_jurisdiction                                                 Michigan
wwtp_id                                                               1729
reporting_jurisdiction                                            Michigan
sample_location                                     Before treatment plant
key_plot_id              NWSS_mi_1729_Before treatment plant_203_raw wa...
county_names                                                         Wayne
county_fips                                                          26163
population_served                                                     5190
date_start                                                      2022-12-05
date_end                                                        2022-12-19
detect_prop_15d                                                        NaN
percentile                                                             NaN
sampling_prior                                                         yes
first_sample_date                                               2021-09-01
ptc_15d                                                                NaN
sample_location_specify                                                203

                                                                    303371  \
wwtp_jurisdiction                                                 Michigan
wwtp_id                                                               1729
reporting_jurisdiction                                            Michigan
sample_location                                     Before treatment plant
key_plot_id              NWSS_mi_1729_Before treatment plant_208_raw wa...
county_names                                                       Oakland
county_fips                                                          26125
population_served                                                     5800
date_start                                                      2022-12-05
date_end                                                        2022-12-19
detect_prop_15d                                                        NaN
percentile                                                             NaN
sampling_prior                                                         yes
first_sample_date                                               2021-09-02
ptc_15d                                                                NaN
sample_location_specify                                                208

                                                                    564464  \
wwtp_jurisdiction                                                 Michigan
wwtp_id                                                               1729
reporting_jurisdiction                                            Michigan
sample_location                                     Before treatment plant
key_plot_id              NWSS_mi_1729_Before treatment plant_302_raw wa...
county_names                                                        Macomb
county_fips                                                          26099
population_served                                                    56026
date_start                                                      2022-12-05
date_end                                                        2022-12-19
detect_prop_15d                                                        100
percentile                                                          66.667
sampling_prior                                                         yes
first_sample_date                                               2021-07-21
ptc_15d                                                                -85
sample_location_specify                                                302

                                                                    576458  \
wwtp_jurisdiction                                                 Michigan
wwtp_id                                                               1729
reporting_jurisdiction                                            Michigan
sample_location                                     Before treatment plant
key_plot_id              NWSS_mi_1729_Before treatment plant_205_raw wa...
county_names                                                        Macomb
county_fips                                                          26099
population_served                                                    99970
date_start                                                      2022-12-05
date_end                                                        2022-12-19
detect_prop_15d                                                        NaN
percentile                                                             NaN
sampling_prior                                                         yes
first_sample_date                                               2021-08-31
ptc_15d                                                                NaN
sample_location_specify                                                205

                                                                    577230
wwtp_jurisdiction                                                 Michigan
wwtp_id                                                               1729
reporting_jurisdiction                                            Michigan
sample_location                                     Before treatment plant
key_plot_id              NWSS_mi_1729_Before treatment plant_207_raw wa...
county_names                                                        Macomb
county_fips                                                          26099
population_served                                                    37570
date_start                                                      2022-12-05
date_end                                                        2022-12-19
detect_prop_15d                                                        NaN
percentile                                                             NaN
sampling_prior                                                         yes
first_sample_date                                               2021-08-31
ptc_15d                                                                NaN
sample_location_specify                                                207
#+end_example

and to get a shorter view, looking at just the =key_plot_id='s, since those seem to capture all the key values (key as in database).
#+begin_src jupyter-python :session *nwss
df_metric[(df_metric.wwtp_id == '1729') & (df_metric.date_start=="2022-12-05")].key_plot_id.unique()
#+end_src

#+RESULTS:
#+begin_example
array(['NWSS_mi_1729_Before treatment plant_466_raw wastewater',
       'NWSS_mi_1729_Before treatment plant_305_raw wastewater',
       'NWSS_mi_1729_Before treatment plant_206_raw wastewater',
       'NWSS_mi_1729_Before treatment plant_301_raw wastewater',
       'NWSS_mi_1729_Before treatment plant_300_raw wastewater',
       'NWSS_mi_1729_Before treatment plant_203_raw wastewater',
       'NWSS_mi_1729_Before treatment plant_208_raw wastewater',
       'NWSS_mi_1729_Before treatment plant_302_raw wastewater',
       'NWSS_mi_1729_Before treatment plant_205_raw wastewater',
       'NWSS_mi_1729_Before treatment plant_207_raw wastewater'],
      dtype=object)
#+end_example

=wwtp_id==1729= is a before treatment plant sample, and has multiple =sample_location_specify= values, so they are sampling at several locations upstream of the treatment plant, some of which also happen to be in different counties.

*** =county_fips= -> =wwtp_id=?
First, for each =wwtp_id=, how many =county_fips= are there?
#+begin_src jupyter-python :session *nwss
df_metric.groupby(by = "county_fips").agg({"wwtp_id" : "nunique"}).sort_values(by="wwtp_id")
#+end_src

#+RESULTS:
#+begin_example
             wwtp_id
county_fips
01033              1
28071              1
29007              1
29009              1
29009,29109        1
...              ...
17043             10
15003             10
17031             12
48113             13
48201             30

[844 rows x 1 columns]
#+end_example
So there are more counties with several to many =wwtp_id='s. For example:
#+begin_src jupyter-python :session *nwss

df_metric[(df_metric.county_fips == '48201') & (df_metric.date_start=="2022-12-05")].transpose()
#+end_src

** Dates

#+begin_src jupyter-python :session *nwss
t = (pd.to_datetime(df_metric["date_start"]) - pd.to_datetime(df_metric["date_end"])).unique()
np.timedelta64(t[0], "D")
#+end_src

#+RESULTS:
: numpy.timedelta64(-14,'D')

all are from exactly 2 week averages, but the frequencies are somewhat difficult to compute.

#+begin_src jupyter-python :session *nwss
df_metric.groupby(by="wwtp_id").agg({"date_start" : "nunique"})
#np.diff(pd.to_datetime(df_metric["date_start"])))
#+end_src

#+RESULTS:
#+begin_example
         date_start
wwtp_id
1               801
10              801
1000            541
1006            135
1007            618
...             ...
995             534
996             541
997             633
998             541
999             136

[1478 rows x 1 columns]
#+end_example
